ivanpashko-compeng/ClampRobotCode/Code_For_SensePicker/PCB_ESP32_VERSION.cpp
#include <ESP32Servo.h>
#include <IRremote.hpp>


// 1. PIN DEFINITIONS & REMOTE HEX CODES

#define IR_RECEIVE_PIN 3   // IR Receiver Pin
#define TRIG_PIN 15        // Trigger PIN
#define RC_LED_PIN 44      // RX: RC Mode Indicator LED
#define IR_BLINK_PIN 43    // TX: Remote Signal Feedback LED

#define CENTER_LED_PIN 1  // Center sensor LED
#define SIDE_LED_PIN 2    // Left/right sensors LED

// Small Stepper Pins (28BYJ-48)
#define IN1 11
#define IN2 10
#define IN3 9
#define IN4 46

// Main Stepper Pins (DRV8825 + NEMA 17)
#define STEP_PIN 5
#define DIR_PIN 6
#define ENABLE_PIN 4

// IR Remote Button Codes
#define UP_CODE 0xF609FF00         // Remote UP Button (Forward Drive)
#define DOWN_CODE 0xF807FF00       // Remote DOWN Button (Reverse Drive)
#define RIGHT_CODE 0xBC43FF00      // Servo Steer Right
#define LEFT_CODE 0xBB44FF00       // Servo Steer Left
#define VOL_PLUS_CODE 0xB946FF00   // Speed Up
#define VOL_MINUS_CODE 0xEA15FF00  // Slow Down
#define FUNC_STOP_CODE 0xB847FF00  // Trigger Forklift Assist
#define POWER_CODE 0xBA45FF00      // System Power ON/OFF
#define EQ_CODE 0xE619FF00         // Small Stepper +30 deg (CW)
#define ST_REPT_CODE 0xF20DFF00    // Small Stepper -30 deg (CCW)
#define RC_MODE 0xBF40FF00         // RC Auto Avoidance Toggle


// 2. CONSTANTS & CONFIGURATION VALUES

#define DIR_FORWARD HIGH  // Corrected: HIGH physically spins motor FORWARD
#define DIR_REVERSE LOW   // Corrected: LOW physically spins motor BACKWARD

#define servostarting 97
#define servodegree 20
#define ASSIST_STEER_DEGREE 45     // 45 deg assist steering angle
#define DEBOUNCE_MS 60

const int THIRTY_DEG_STEPS = 342;
const int THREE_HUNDRED_DEG_STEPS = 3414;

const float WHEELBASE_MM = 180.0;
const float WHEEL_CIRCUMFERENCE_MM = 267.035;  // PI * 85mm

// Speed tiers: 600us (Fast), 1200us, 2400us, 3600us, 4800us (Super Slow)
const uint32_t speedLevels[5] = { 600, 1200, 2400, 3600, 4800 };
const uint32_t FORKLIFT_SLOW_SPEED = 2400;  // 2400us step delay for assist movements
const uint32_t smallStepIntervalMicros = 1500;

// Logical sensor order: GPIO16 Center, GPIO17 Left, GPIO18 Top, GPIO8 Right
const int echoPins[4] = { 16, 17, 18, 8 };  // 0:Center, 1:Left, 2:Top, 3:Right
const char* sensorNames[4] = { "16 (Center)", "17 (Left)", "18 (Top)", "8 (Right)" };
const uint32_t sensorIntervalMs = 60;
const uint32_t rcmodecheckinterval = 50;     // 50ms crosstalk dissipation delay

const bool stepSequence[8][4] = {
  { 1, 0, 0, 0 },
  { 1, 1, 0, 0 },
  { 0, 1, 0, 0 },
  { 0, 1, 1, 0 },
  { 0, 0, 1, 0 },
  { 0, 0, 1, 1 },
  { 0, 0, 0, 1 },
  { 1, 0, 0, 1 }
};


// 3. GLOBAL VARIABLES & STATE TRACKERS

Servo servo;

bool systemPower = true;
bool rcmode = false;
int stepState = 0;  // 1 = Forward, -1 = Reverse, 0 = Stop

int speedIndex = 3;                   // Boot default: Index 3 (3600 us)
uint32_t stepIntervalMicros = 3600;   // Boot default: 3600 us
uint32_t lastStepTime = 0;

int smallStepIndex = 0;
int smallStepTarget = 0;
uint32_t lastSmallStepMicros = 0;

int currentSensor = 0;
uint32_t lastSensorCheckMs = 0;
float sensorDistances[4] = { 0.0, 0.0, 0.0, 0.0 };

bool servoAtLeft = false;
bool servoAtRight = false;

uint32_t lastIRTime = 0;
uint32_t lastCode = 0;

uint32_t irBlinkStartTime = 0;
uint32_t autoSteerResetTime = 0;
uint32_t lastrcmodecheck = 0;

int rcStateIndex = 0; // roundrobin index for RC mode (0: Right, 1: Left, 2: Center)


// 4. HELPER FUNCTIONS


// Pulse Driver Step Pin
void pulseStep() {
  digitalWrite(STEP_PIN, HIGH);
  delayMicroseconds(5);
  digitalWrite(STEP_PIN, LOW);
}

// Steering Backlash Compensation (+25 deg overshoot on right side return)
void straightenServo(bool cameFromLeft) {
  if (cameFromLeft) {
    servo.write(servostarting + 25);
  } else {
    servo.write(servostarting - 15);
  }
  delay(120);
  servo.write(servostarting);        // Settle dead center at 97 deg
  delay(50);
}

// Power Abort Override Check
bool checkpowerOverride() {
  if (IrReceiver.decode()) {
    uint32_t code = IrReceiver.decodedIRData.decodedRawData;
    if (code == POWER_CODE) {
      systemPower = false;
      stepState = 0;
      digitalWrite(ENABLE_PIN, HIGH);
      digitalWrite(IN1, LOW);
      digitalWrite(IN2, LOW);
      digitalWrite(IN3, LOW);
      digitalWrite(IN4, LOW);
      digitalWrite(RC_LED_PIN, LOW);
      digitalWrite(IR_BLINK_PIN, LOW);
      digitalWrite(CENTER_LED_PIN, LOW);
      digitalWrite(SIDE_LED_PIN, LOW);
      Serial.println(F("\n>>> POWER OVERRIDE TRIGGERED ABORTING ALL OPERATIONS <<<"));
      IrReceiver.resume();
      return true;
    }
  }
  return !systemPower;
}

// Non Blocking Manual Control for Small Stepper
void runSmallStepperManual() {
  if (!systemPower || smallStepTarget == 0) return;

  uint32_t currentMicros = micros();
  if (currentMicros - lastSmallStepMicros >= smallStepIntervalMicros) {
    lastSmallStepMicros = currentMicros;

    digitalWrite(IN1, stepSequence[smallStepIndex][0]);
    digitalWrite(IN2, stepSequence[smallStepIndex][1]);
    digitalWrite(IN3, stepSequence[smallStepIndex][2]);
    digitalWrite(IN4, stepSequence[smallStepIndex][3]);

    if (smallStepTarget > 0) {
      smallStepIndex++;
      smallStepTarget--;
      if (smallStepIndex > 7) smallStepIndex = 0;
    } else if (smallStepTarget < 0) {
      smallStepIndex--;
      smallStepTarget++;
      if (smallStepIndex < 0) smallStepIndex = 7;
    }

    if (smallStepTarget == 0) {
      digitalWrite(IN1, LOW);
      digitalWrite(IN2, LOW);
      digitalWrite(IN3, LOW);
      digitalWrite(IN4, LOW);
    }
  }
}

// Fast singleping Reader (8000us timeout = 1.3m reach)
float quickReadSensorMm(int index, float maxCapMm = 1000.0) {
  digitalWrite(TRIG_PIN, LOW);
  delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH);
  delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);

  long dur = pulseIn(echoPins[index], HIGH, 8000);
  if (dur > 0) {
    float dist = (dur * 0.343) / 2.0;
    if (dist >= 10.0 && dist <= maxCapMm) {
      return dist;
    }
  }
  return 0.0;
}

