ivanpashko-compeng/ClampRobotCode/Code_For_SensePicker/PCB_ESP32_VERSION.cpp
// 3 ping Median Filter Ultrasonic Sensor Helper
float readSensorMm(int index, float maxCapMm = 1000.0) {
  float reads[3];
  int validCount = 0;

  for (int i = 0; i < 3; i++) {
    digitalWrite(TRIG_PIN, LOW);
    delayMicroseconds(2);
    digitalWrite(TRIG_PIN, HIGH);
    delayMicroseconds(10);
    digitalWrite(TRIG_PIN, LOW);

    long dur = pulseIn(echoPins[index], HIGH, 8000);
    if (dur > 0) {
      float dist = (dur * 0.343) / 2.0;
      if (dist >= 10.0 && dist <= maxCapMm) {
        reads[validCount++] = dist;
      }
    }
    delay(4);
  }

  if (validCount == 0) return 0.0;
  if (validCount == 1) return reads[0];
  if (validCount == 2) return (reads[0] + reads[1]) / 2.0;

  if (reads[0] > reads[1]) { float t = reads[0]; reads[0] = reads[1]; reads[1] = t; }
  if (reads[1] > reads[2]) { float t = reads[1]; reads[1] = reads[2]; reads[2] = t; }
  if (reads[0] > reads[1]) { float t = reads[0]; reads[0] = reads[1]; reads[1] = t; }
  return reads[1];
}

// Background Ultrasonic Sensor Scanner (Manual Mode)
void checkUltrasonicSensors() {
  if (!systemPower || rcmode) return;

  uint32_t currentMillis = millis();
  if (currentMillis - lastSensorCheckMs >= sensorIntervalMs) {
    lastSensorCheckMs = currentMillis;

    float distMm = quickReadSensorMm(currentSensor, 1000.0);
    sensorDistances[currentSensor] = (distMm > 0.0) ? distMm : 0.0;

    currentSensor++;
    if (currentSensor > 3) {
      currentSensor = 0;

      Serial.print(F("[SENSORS mm] Center: "));
      Serial.print(sensorDistances[0], 1);
      Serial.print(F(" | Left: "));
      Serial.print(sensorDistances[1], 1);
      Serial.print(F(" | Top: "));
      Serial.print(sensorDistances[2], 1);
      Serial.print(F(" | Right: "));
      Serial.println(sensorDistances[3], 1);
      Serial.flush();
    }

    bool centerOn = (sensorDistances[0] > 0.0 && sensorDistances[0] <= 250.0);
    bool sideOn   = ((sensorDistances[1] > 0.0 && sensorDistances[1] <= 125.0) || 
                     (sensorDistances[3] > 0.0 && sensorDistances[3] <= 125.0));

    digitalWrite(CENTER_LED_PIN, centerOn ? HIGH : LOW);
    digitalWrite(SIDE_LED_PIN, sideOn ? HIGH : LOW);
  }
}

// RC Mode Auto Avoidance
void rcmodecheck() {
  if (checkpowerOverride() || !rcmode) return;

  uint32_t currentMillis = millis();
  if ((currentMillis - lastrcmodecheck) >= rcmodecheckinterval) {
    lastrcmodecheck = currentMillis;

    // Round robin sensor scanning (1 sensor per pass)
    if (rcStateIndex == 0) {
      sensorDistances[3] = quickReadSensorMm(3, 1000.0); // Right
      rcStateIndex = 1;
    } else if (rcStateIndex == 1) {
      sensorDistances[1] = quickReadSensorMm(1, 1000.0); // Left
      rcStateIndex = 2;
    } else {
      sensorDistances[0] = quickReadSensorMm(0, 1000.0); // Center
      rcStateIndex = 0;
    }

    float distanceright  = sensorDistances[3];
    float distanceleft   = sensorDistances[1];
    float distancecenter = sensorDistances[0];

    // Drive Indicator LEDs (250mm center, 350mm side)
    bool centerOn = (distancecenter > 0.0 && distancecenter <= 250.0);
    bool sideOn   = ((distanceleft > 0.0 && distanceleft <= 350.0) || 
                     (distanceright > 0.0 && distanceright <= 350.0));
    digitalWrite(CENTER_LED_PIN, centerOn ? HIGH : LOW);
    digitalWrite(SIDE_LED_PIN, sideOn ? HIGH : LOW);

    // 1. Auto Brake on Center Obstacle (< 250mm)
    if (distancecenter > 0.0 && distancecenter < 250.0) {
      digitalWrite(ENABLE_PIN, HIGH);
      stepState = 0;
      servo.write(servostarting);
      Serial.println(F("[RC MODE AUTO BRAKE] Center obstacle detected!"));
      Serial.flush();
    }
    // 2. Early Side Nudges (< 350mm)
    else if (distanceright > 0.0 && distanceright < 350.0) {
      Serial.println(F("[RC MODE AUTO STEER] Nudging Left"));
      Serial.flush();
      servo.write(servostarting - servodegree);
      autoSteerResetTime = currentMillis + 400;
    } else if (distanceleft > 0.0 && distanceleft < 350.0) {
      Serial.println(F("[RC MODE AUTO STEER] Nudging Right"));
      Serial.flush();
      servo.write(servostarting + servodegree);
      autoSteerResetTime = currentMillis + 400;
    }
    // 3. Danger Zone Safety Reverse (< 50mm)
    else if ((distanceleft <= 50.0 && distanceleft > 0.0) || 
             (distancecenter <= 50.0 && distancecenter > 0.0) || 
             (distanceright <= 50.0 && distanceright > 0.0)) {
      Serial.println(F("[RC MODE SAFETY REVERSE] Reversing away..."));
      Serial.flush();
      digitalWrite(ENABLE_PIN, LOW);
      digitalWrite(DIR_PIN, DIR_REVERSE);
      delay(10);

      for (int i = 0; i < 350; i++) {
        pulseStep();
        delayMicroseconds(FORKLIFT_SLOW_SPEED);
      }
      stepState = 0;
      digitalWrite(ENABLE_PIN, HIGH);
    }
  }
}

// Forklift Assist: Final Alignment & Dynamic Payload Grab
void onceLinedUpDriveAndGrab(float dCenter) {
  if (checkpowerOverride()) return;

  smallStepTarget = 0;

  // Take a fresh precise reading from center sensor up to 400mm
  float preciseCenter = readSensorMm(0, 400.0);
  if (preciseCenter > 0.0) {
    dCenter = preciseCenter;
  }

  Serial.print(F("[CENTER TARGET CONFIRMED] Distance: "));
  Serial.print(dCenter, 1);
  Serial.println(F(" mm."));
  Serial.flush();

  float targetBuffer = 65.0; // Stop when 55mm away from payload
  float currentDist = dCenter;

  // Drive forward if farther than 55mm
  if (currentDist > targetBuffer) {
    digitalWrite(ENABLE_PIN, LOW);
    digitalWrite(DIR_PIN, DIR_FORWARD); // HIGH = drives forward
    delay(10);

    Serial.print(F("[DRIVING TOWARDS PAYLOAD] Current distance: "));
    Serial.print(currentDist, 1);
    Serial.println(F(" mm..."));
    Serial.flush();

    int stepCounter = 0;

    // Dynamic closed loop approach toward payload
    while (currentDist > targetBuffer && stepCounter < 800) {
      if (checkpowerOverride()) return;

      // Sample center sensor every 17 steps (3567us average delay / 0.37 m/s speed)
      if (stepCounter % 17 == 0) {
        float threepingmedian = readSensorMm(0, 400.0);
        if (threepingmedian > 0.0) {
          currentDist = threepingmedian; // Live updates distance as car moves closer
        }
      }

