ivanpashko-compeng/ClampRobotCode/Code_For_SensePicker/PCB_ESP32_VERSION.cpp
      pulseStep();
      delayMicroseconds(FORKLIFT_SLOW_SPEED);
      stepCounter++;
    }

    stepState = 0;
    digitalWrite(ENABLE_PIN, HIGH);
    Serial.println(F("[DRIVE COMPLETE] Arrived at payload threshold."));
    Serial.flush();
  } else {
    Serial.println(F("[POSITION OK] Already at target threshold."));
    Serial.flush();
  }

  // Execute Uninterrupted Claw Grab
  if (systemPower) {
    Serial.println(F("[CLAW] Rotating front stepper 300 degrees clockwise to GRAB..."));
    Serial.flush();

    for (int s = 0; s < THREE_HUNDRED_DEG_STEPS; s++) {
      if (checkpowerOverride()) {
        stepState = 0;
        digitalWrite(ENABLE_PIN, HIGH);
        return;
      }

      digitalWrite(IN1, stepSequence[smallStepIndex][0]);
      digitalWrite(IN2, stepSequence[smallStepIndex][1]);
      digitalWrite(IN3, stepSequence[smallStepIndex][2]);
      digitalWrite(IN4, stepSequence[smallStepIndex][3]);

      smallStepIndex++;
      if (smallStepIndex > 7) smallStepIndex = 0;
      delayMicroseconds(smallStepIntervalMicros);
    }

    digitalWrite(IN1, LOW);
    digitalWrite(IN2, LOW);
    digitalWrite(IN3, LOW);
    digitalWrite(IN4, LOW);

    smallStepTarget = 0;

    Serial.println(F("=== FORKLIFT ASSIST COMPLETE: PAYLOAD SECURED ==="));
    Serial.flush();
  }

  stepState = 0;
  digitalWrite(ENABLE_PIN, HIGH);
}

// Forklift Assist: Search & Align Decision Engine
void executeForkliftAssist() {
  Serial.println(F("\n=== FORKLIFT ASSIST INITIATED ==="));
  Serial.flush();

  if (checkpowerOverride()) return;

  float distTop = readSensorMm(2, 90.0);
  if (distTop > 0.0) {
    Serial.print(F("[ABORT] Low ceiling detected: "));
    Serial.print(distTop, 1);
    Serial.println(F(" mm"));
    Serial.flush();
    return;
  }

  float dCenter = readSensorMm(0, 400.0);
  float dLeft   = readSensorMm(1, 120.0);
  float dRight  = readSensorMm(3, 120.0);

  // PATHWAY A: Target straight ahead
  if (dCenter > 0.0) {
    Serial.println(F("[PATHWAY A] Target detected in front of Center Sensor!"));
    Serial.flush();
    onceLinedUpDriveAndGrab(dCenter);
    return;
  }

  // PATHWAY B1: Object on Right Sensor = Sweep Left at 45 deg & reverse arc
  else if (dRight > 0.0 && dCenter == 0.0) {
    Serial.println(F("[PATHWAY B1] Object on Right! Steering left 45 deg & reversing arc..."));
    Serial.flush();
    servo.write(servostarting - ASSIST_STEER_DEGREE);
    delay(150);

    digitalWrite(ENABLE_PIN, LOW);
    digitalWrite(DIR_PIN, DIR_REVERSE);
    delay(10);

    int reverseStepCount = 0;
    const int MAX_REVERSE_STEPS = 340; // 45cm reverse arc limit
    bool targetAcquired = false;
    float foundCenterDist = 0.0;

    while (reverseStepCount < MAX_REVERSE_STEPS) {
      if (checkpowerOverride()) return;

      pulseStep();
      delayMicroseconds(FORKLIFT_SLOW_SPEED);
      reverseStepCount++;

      // Force initial arc travel (step 110) before testing center sensor lock
      if (reverseStepCount >= 110 && reverseStepCount % 8 == 0) {
        float cCheck = quickReadSensorMm(0, 400.0);
        if (cCheck > 0.0) {
          Serial.println(F("[TARGET ACQUIRED] Center sensor aligned during arc!"));
          Serial.flush();
          targetAcquired = true;
          foundCenterDist = cCheck;
          break; // Exit arc as soon as center locks on
        }
      }
    }

    straightenServo(true);
    digitalWrite(ENABLE_PIN, HIGH);

    // Re verify center sensor after wheels straighten
    delay(120);
    float finalCenterCheck = readSensorMm(0, 400.0);
    if (finalCenterCheck > 0.0) {
      foundCenterDist = finalCenterCheck;
      targetAcquired = true;
    } else if (!targetAcquired && dRight > 0.0) { // this can cause false positives
      foundCenterDist = dRight + 40.0;
      targetAcquired = true;
    }

    if (targetAcquired && foundCenterDist > 0.0) {
      onceLinedUpDriveAndGrab(foundCenterDist);
    }
    return;
  }

  // PATHWAY B2: Object on Left Sensor = Sweep Right at 45 deg & reverse arc
  else if (dLeft > 0.0 && dCenter == 0.0) {
    Serial.println(F("[PATHWAY B2] Object on Left! Steering right 45 deg & reversing arc..."));
    Serial.flush();
    servo.write(servostarting + ASSIST_STEER_DEGREE);
    delay(150);

    digitalWrite(ENABLE_PIN, LOW);
    digitalWrite(DIR_PIN, DIR_REVERSE);
    delay(10);

    int reverseStepCount = 0;
    const int MAX_REVERSE_STEPS = 320; // ~42cm reverse arc limit
    bool targetAcquired = false;
    float foundCenterDist = 0.0;

    while (reverseStepCount < MAX_REVERSE_STEPS) {
      if (checkpowerOverride()) return;

      pulseStep();
      delayMicroseconds(FORKLIFT_SLOW_SPEED);
      reverseStepCount++;

      // Force initial arc travel (step 110) before testing center sensor lock
      if (reverseStepCount >= 110 && reverseStepCount % 8 == 0) {
        float cCheck = quickReadSensorMm(0, 400.0);
        if (cCheck > 0.0) {
          Serial.println(F("[TARGET ACQUIRED] Center sensor aligned during arc!"));
          Serial.flush();
          targetAcquired = true;
          foundCenterDist = cCheck;
          break; // Exit arc as soon as center locks on
        }
      }
    }

    straightenServo(false);
    digitalWrite(ENABLE_PIN, HIGH);

    // Re verify center sensor after wheels straighten
    delay(120);
    float finalCenterCheck = readSensorMm(0, 400.0);
    if (finalCenterCheck > 0.0) {
      foundCenterDist = finalCenterCheck;
      targetAcquired = true;
    } else if (!targetAcquired && dLeft > 0.0) { // this can cause false positives
      foundCenterDist = dLeft + 40.0;
      targetAcquired = true;
    }

    if (targetAcquired && foundCenterDist > 0.0) {
      onceLinedUpDriveAndGrab(foundCenterDist);
    }
    return;
  }
}


// 5. SETUP FUNCTION

void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println(F("\n\n   FORKLIFT FIRMWARE ONLINE    "));
  Serial.flush();

  // ESP32-S3 Hardware Timer Allocation for Servo
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  servo.setPeriodHertz(50);
  servo.attach(7, 500, 2400);
  servo.write(servostarting);

  IrReceiver.begin(IR_RECEIVE_PIN, DISABLE_LED_FEEDBACK);

  pinMode(IN1, OUTPUT);
  pinMode(IN2, OUTPUT);
  pinMode(IN3, OUTPUT);
  pinMode(IN4, OUTPUT);

