ivanpashko-compeng/ClampRobotCode/Code_For_SensePicker/PCB_ESP32_VERSION.cpp
  pinMode(STEP_PIN, OUTPUT);
  pinMode(DIR_PIN, OUTPUT);
  pinMode(ENABLE_PIN, OUTPUT);

  digitalWrite(ENABLE_PIN, HIGH);  // Driver sleep mode on startup
  digitalWrite(STEP_PIN, LOW);
  digitalWrite(DIR_PIN, LOW);

  pinMode(TRIG_PIN, OUTPUT);
  digitalWrite(TRIG_PIN, LOW);

  for (int i = 0; i < 4; i++) {
    pinMode(echoPins[i], INPUT);
  }

  // External PCB indicator LEDs must explicitly be configured as outputs.
  // Without this, GPIO 43/44 remain inputs and an indicator may stay lit.
  pinMode(RC_LED_PIN, OUTPUT);
  pinMode(IR_BLINK_PIN, OUTPUT);
  pinMode(CENTER_LED_PIN, OUTPUT);
  pinMode(SIDE_LED_PIN, OUTPUT);

  digitalWrite(RC_LED_PIN, LOW);
  digitalWrite(IR_BLINK_PIN, LOW);
  digitalWrite(CENTER_LED_PIN, LOW);
  digitalWrite(SIDE_LED_PIN, LOW);
}


// 6. MAIN LOOP FUNCTION



int nowinterval = 2000;
uint32_t reset_time = 0;
void elapsedtime(){

uint32_t localtime = millis();


if (localtime - reset_time > nowinterval) {
  Serial.printf("Elapsed time: %u\n", localtime);
  Serial.flush();
  reset_time = millis();


}
}

void loop() {

  uint32_t now = millis();
  elapsedtime();
  
  
  

  // 0. Non-Blocking Led & Servo Timers
  if (irBlinkStartTime > 0 && (now - irBlinkStartTime >= 50)) {
    digitalWrite(IR_BLINK_PIN, LOW);
    irBlinkStartTime = 0;
  }

  if (autoSteerResetTime > 0 && now >= autoSteerResetTime) {
    servo.write(servostarting);
    autoSteerResetTime = 0;
  }

  // 1. RC Auto-Avoidance Engine
  rcmodecheck();

  // 2. Small Stepper Manual Movement Engine
  runSmallStepperManual();

  // 3. Background Ultrasonic Sensor Scanner
  checkUltrasonicSensors();

  // 4. IR Remote Receiver & Parser
  if (IrReceiver.decode()) {
    uint32_t code = IrReceiver.decodedIRData.decodedRawData;

    if (IrReceiver.decodedIRData.protocol != UNKNOWN && code != 0 && code != 0xFFFFFFFF) {

      if (code != lastCode || (now - lastIRTime) > DEBOUNCE_MS) {
        lastCode = code;
        lastIRTime = now;

        digitalWrite(IR_BLINK_PIN, HIGH);
        irBlinkStartTime = now;

        Serial.print(F("\n[IR INPUT] Code: 0x"));
        Serial.println(code, HEX);
        Serial.flush();

        if (code == POWER_CODE) {
          systemPower = !systemPower;
          if (!systemPower) {
            stepState = 0;
            digitalWrite(ENABLE_PIN, HIGH);
            digitalWrite(IN1, LOW);
            digitalWrite(IN2, LOW);
            digitalWrite(IN3, LOW);
            digitalWrite(IN4, LOW);
            digitalWrite(RC_LED_PIN, LOW);
            digitalWrite(IR_BLINK_PIN, LOW);
            digitalWrite(CENTER_LED_PIN, LOW);
            digitalWrite(SIDE_LED_PIN, LOW);
            Serial.println(F(">>> SYSTEM POWERED OFF (SLEEP MODE) <<<"));
            Serial.flush();
          } else {
            Serial.println(F(">>> SYSTEM POWERED ON <<<"));
            Serial.flush();
          }
        }

        if (systemPower) {

          if (code == VOL_PLUS_CODE) {
            if (speedIndex > 0) speedIndex--;
            stepIntervalMicros = speedLevels[speedIndex];
            Serial.print(F("[SPEED UP] NEMA 17 Interval: "));
            Serial.print(stepIntervalMicros);
            Serial.println(F(" us"));
            Serial.flush();
          } else if (code == VOL_MINUS_CODE) {
            if (speedIndex < 4) speedIndex++;
            stepIntervalMicros = speedLevels[speedIndex];
            Serial.print(F("[SLOW DOWN] NEMA 17 Interval: "));
            Serial.print(stepIntervalMicros);
            Serial.println(F(" us"));
            Serial.flush();
          } else if (code == EQ_CODE) {
            smallStepTarget += THIRTY_DEG_STEPS;
            Serial.println(F("[SMALL STEPPER] Moving +30 deg (CW)"));
            Serial.flush();
          } else if (code == ST_REPT_CODE) {
            smallStepTarget -= THIRTY_DEG_STEPS;
            Serial.println(F("[SMALL STEPPER] Moving -30 deg (CCW)"));
            Serial.flush();
          } else if (code == FUNC_STOP_CODE) {
            executeForkliftAssist();
          } else if (code == UP_CODE) {
            stepState = (stepState == 1) ? 0 : 1;
            Serial.println((stepState == 1) ? F("[DRIVE] FORWARD Enabled") : F("[DRIVE] STOPPED"));
            Serial.flush();
          } else if (code == DOWN_CODE) {
            stepState = (stepState == -1) ? 0 : -1;
            Serial.println((stepState == -1) ? F("[DRIVE] REVERSE Enabled") : F("[DRIVE] STOPPED"));
            Serial.flush();
          } else if (code == LEFT_CODE) {
            if (servoAtLeft) {
              servo.write(servostarting);
              servoAtLeft = false;
            } else {
              servo.write(servostarting - servodegree);
              servoAtLeft = true;
              servoAtRight = false;
            }
          } else if (code == RIGHT_CODE) {
            if (servoAtRight) {
              servo.write(servostarting);
              servoAtRight = false;
            } else {
              servo.write(servostarting + servodegree);
              servoAtRight = true;
              servoAtLeft = false;
            }
          } else if (code == RC_MODE) {
            rcmode = !rcmode;
            digitalWrite(RC_LED_PIN, rcmode ? HIGH : LOW);
            Serial.print(F("[RC MODE] "));
            Serial.println(rcmode ? F("ENABLED (LED ON)") : F("DISABLED (LED OFF)"));
            Serial.flush();
          }
        }
      }
    }

    IrReceiver.resume();
  }

  // 5. Main Stepper Drive Engine
  if (systemPower && stepState != 0) {
    digitalWrite(ENABLE_PIN, LOW);

    if (stepState == 1) {
      digitalWrite(DIR_PIN, DIR_FORWARD); // HIGH = drives physically FORWARD
    } else if (stepState == -1) {
      digitalWrite(DIR_PIN, DIR_REVERSE); // LOW = drives physically BACKWARD
    }

    uint32_t currentMicros = micros();
    if (currentMicros - lastStepTime >= stepIntervalMicros) {
      lastStepTime = currentMicros;
      pulseStep();
    }

  } else {
    digitalWrite(STEP_PIN, LOW);
    digitalWrite(ENABLE_PIN, HIGH);
  }
}
